#### TextNoteLeaderTypes Enumeration

---

|  |
| --- |
| See Also |

Types of text-note leaders

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum TextNoteLeaderTypes ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration TextNoteLeaderTypes ``` |

| Visual C++ |
| --- |
| ``` public enum class TextNoteLeaderTypes ``` |

# Members

| Member name | Description |
| --- | --- |
| TNLT\_STRAIGHT\_L | A line leader attached from the left side of a text element |
| TNLT\_STRAIGHT\_R | A line leader attached from the right side of a text element |
| TNLT\_ARC\_L | An arc leader attached from the left side of a text element |
| TNLT\_ARC\_R | An arc leader attached from the right side of a text element |

# See Also

Autodesk.Revit.DB Namespace